using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

using Xamarin.Forms;
using Xamarin.Forms.Xaml;

namespace LWver2
{
	[XamlCompilation(XamlCompilationOptions.Compile)]
	public partial class Page2 : ContentPage
	{

        public Page2 (int mealActivate)
		{
			InitializeComponent ();
            
            switch (mealActivate)
            {
                case 1:
                    Breakfastest();
                    break;
                case 2:
                    Lunch();
                    break;
                case 3:
                    Dinner();
                    break;
                case 4:
                    Snacks();
                    break;
            }

        }

        //Meals
        public void Breakfastest()
		{
            Visible(1);
            BreakfastChooseOne.Text = "1. " + RandomBreakfast(Randomize(28));
            BreakfastChooseTwo.Text = "2. " + Drink(Randomize(32));
        }
        public void Lunch()
        {
            Visible(2);
            LunchChooseOne.Text ="1. " + RandomDinnerSoup(Randomize(32));
            LunchChooseTwo.Text ="2. " +  RandomLunchAndDinner(Randomize(148));
            LunchChooseThree.Text ="3. " + Salad(Randomize(40));
            LunchChooseFour.Text = "4. " + Drink(Randomize(32));
        }
        public void Dinner()
        {
            Visible(3);
            DinnerChooseOne.Text = "1. " + RandomLunchAndDinner(Randomize(148));
            DinnerChooseTwo.Text = "2. " + RandomSnacks(Randomize(147));
            DinnerChooseThree.Text = "3. " + Drink(Randomize(32));
        }
        public void Snacks()
        {
            Visible(4);
            SnacksChooseOne.Text = "1. " + RandomSnacks(Randomize(146));
            SnacksChooseTwo.Text = "2. " + Drink(Randomize(32));
        }

        //Visible
        public void Visible(int num)
        { 
            switch (num) 
            {
                case 1:
                    ChooseBreakfastOne.IsVisible = true;
                    ChooseBreakfastTwo.IsVisible = true;
                    ChooseLunchOne.IsVisible = false;
                    ChooseLunchTwo.IsVisible = false;
                    ChooseLunchThree.IsVisible = false;
                    ChooseLunchFour.IsVisible = false;
                    ChooseDinnerOne.IsVisible = false;
                    ChooseDinnerTwo.IsVisible = false;
                    ChooseDinnerThree.IsVisible = false;
                    RefreshBrakfast.IsVisible = true;
                    RefreshLunch.IsVisible = false;
                    RefreshDinner.IsVisible = false;
                    RefreshSnacks.IsVisible = false;
                    break;
                case 2:
                    ChooseBreakfastOne.IsVisible = false;
                    ChooseBreakfastTwo.IsVisible = false;
                    ChooseLunchOne.IsVisible = true;
                    ChooseLunchTwo.IsVisible = true;
                    ChooseLunchThree.IsVisible = true;
                    ChooseLunchFour.IsVisible = true;
                    ChooseDinnerOne.IsVisible = false;
                    ChooseDinnerTwo.IsVisible = false;
                    ChooseDinnerThree.IsVisible = false;
                    RefreshBrakfast.IsVisible = false;
                    RefreshLunch.IsVisible = true;
                    RefreshDinner.IsVisible = false;
                    RefreshSnacks.IsVisible = false;
                    break;
                case 3:
                    ChooseBreakfastOne.IsVisible = false;
                    ChooseBreakfastTwo.IsVisible = false;
                    ChooseLunchOne.IsVisible = false;
                    ChooseLunchTwo.IsVisible = false;
                    ChooseLunchThree.IsVisible = false;
                    ChooseLunchFour.IsVisible = false;
                    ChooseDinnerOne.IsVisible = true;
                    ChooseDinnerTwo.IsVisible = true;
                    ChooseDinnerThree.IsVisible = true;
                    RefreshBrakfast.IsVisible = false;
                    RefreshLunch.IsVisible = false;
                    RefreshDinner.IsVisible = true;
                    RefreshSnacks.IsVisible = false;
                    break;
                case 4:
                    ChooseBreakfastOne.IsVisible = false;
                    ChooseBreakfastTwo.IsVisible = false;
                    ChooseLunchOne.IsVisible = false;
                    ChooseLunchTwo.IsVisible = false;
                    ChooseLunchThree.IsVisible = false;
                    ChooseLunchFour.IsVisible = false;
                    ChooseDinnerOne.IsVisible = false;
                    ChooseDinnerTwo.IsVisible = false;
                    ChooseDinnerThree.IsVisible = false;
                    ChooseSnacksOne.IsVisible = true;
                    ChooseSnacksTwo.IsVisible = true;
                    RefreshBrakfast.IsVisible=false;
                    RefreshLunch.IsVisible = false;
                    RefreshDinner.IsVisible = false;
                    RefreshSnacks.IsVisible = true;
                    break;

            }
        
        }

        // Randomize
		public static int Randomize(int second)
		{ 
			Random rnd = new Random();
			return rnd.Next(0,second);
		}

        // List
        public static string RandomBreakfast(int num)
        {
            Dictionary<int, string> JOJI = new Dictionary<int, string>()
            {
                [0] = "Севодня не еш",
                [1] = "Омлет с куриным филе и моцареллой",
                [2] = "Запеканка из творожного сыра с апельсином",
                [3] = "Запеканка творожная с клубникой и папайей",
                [4] = "Запеканка творожная с клюквой/черникой/черной смородиной/с яблоком",
                [5] = "Злаковая каша с ягодами",
                [6] = "Каша молочная овсяная/рисовая/пшенная",
                [7] = "Блин овощной с индейкой и шпинатом",
                [8] = "Блинчики с вишней и шоколадом",
                [9] = "Блины с «Крем чиз» и вишней",
                [10] = "Глазунья из трех яиц",
                [11] = "Гранола тропическая с манго и голубикой",
                [12] = "Омлет с картофелем и куриными сосисками-гриль",
                [13] = "Сырники",
                [14] = "Оладьи",
                [15] = "Омлет с беконом и ветчиной",
                [16] = "Панкейки банановые с клубникой и сгущенным молоком",
                [17] = "Парфе-гранола с голубикой, клубникой и йогуртом",
                [18] = "Рикотники Апельсиновые/Лимонные/Черничные",
                [19] = "Розанчики творожно-сливочные Мини в шоколадной глазури",
                [20] = "Шакшука «Классическая»",
                [21] = "Запеканка творожная с клубникой и папайей",
                [22] = "Каша овсяная с бананом и голубикой",
                [23] = "Каша пшенная молочная с тыквой",
                [24] = "Омлет белковый с куриным филе, овощами и мягким сыром",
                [25] = "Омлет с брокколи",
                [26] = "Омлет с ветчиной и томатами",
                [27] = "Сырники творожные",
            };
            return JOJI[num];
        }
        public static string RandomDinnerSoup(int num)
        {
            Dictionary<int, string> JOJI = new Dictionary<int, string>()
            {
                [0] = "Не супь",
                [1] = "Борщ",
                [2] = "Супь из фасоли с овощами",
                [3] = "Крем-суп «Сырный»  с греночками",
                [4] = "Крем-суп с тыквой и индейкой",
                [5] = "Лагман с говядиной",
                [6] = "Супь с лапшой домашней и филе индейки",
                [7] = "Окрошка овощная",
                [8] = "Окрошка с мясом",
                [9] = "Окрошка с колбасой",
                [10] = "Похлебка грибная",
                [11] = "Рыбный суп с фрикадельками из филе горбуши и судака",
                [12] = "Солянка из семги и форели",
                [13] = "Супь «Гаспачо»",
                [14] = "Супь «Гороховый» с копчёностями",
                [15] = "Супь «Грибной»",
                [16] = "Супь «Куриный»",
                [17] = "Суп «Рамен» с индейкой",
                [18] = "Суп «Рассольник»",
                [19] = "Суп «Свекольник»",
                [20] = "Суп «Том ям»",
                [21] = "Суп «Харчо»",
                [22] = "Суп из щавеля",
                [23] = "Суп «Чечевичный»",
                [24] = "Суп из шпината с филе лосося",
                [25] = "Суп Кукси с курицей на овощном бульоне",
                [26] = "Суп Минестроне",
                [27] = "Суп с куриными фрикадельками и пастой «Звездочки»",
                [28] = "Суп сливочный с мидиями",
                [29] = "Суп щавелевый с курицей",
                [30] = "Щи зеленые",
                [31] = "Щи",
            };
            return JOJI[num];
        }
        public static string RandomLunchAndDinner(int num)
        {
            Dictionary<int, string> JOJI = new Dictionary<int, string>()
            {
                [0] = "Азу по-татарски с картофельным пюре",
                [1] = "Бефстроганов из говядины с гречкой отварной",
                [2] = "Бефстроганов из говядины с картофельным пюре",
                [3] = "Биточек из говядины с капустой и картофельным пюре",
                [4] = "Биточек куриный с капустой и картофельным пюре",
                [5] = "Биточек сочный с пенне   ",
                [6] = "Биточки из индейки с птитимом и соусом песто из кабачков",
                [7] = "Биточки из кролика с пюре из сельдерея и картофеля",
                [8] = "Биточки курин. с цукини с пюре из батата",
                [9] = "Биточки куриные паровые с перлотто",
                [10] = "Биточки куриные с гречкой в соусе барбекю",
                [11] = "Биточки куриные с овощами на пару",
                [12] = "Биточки куриные с сыром и картофелем с укропом",
                [13] = "Биточки куриные с цукини и овощами",
                [14] = "Биточки морковные",
                [15] = "Бифштекс из говядины с картофелем",
                [16] = "Бризоль из рыбы с рисом басмати",
                [17] = "Брокколи на пару",
                [18] = "Буженина в собственном соку",
                [19] = "Булгур с овощами",
                [20] = "Вареники постные с картофелем и грибами",
                [21] = "Вок рамен с курицей в соево-чесночном соусе",
                [22] = "Вок с креветкой в соево-чесночном соусе",
                [23] = "Гедза с говядиной на пару",
                [24] = "Говядина «Бургеньон» с макаронами «Орзо»",
                [25] = "Говядина в сливочном соусе с гречкой",
                [26] = "Говядина в соусе Торес",
                [21] = "Говядина по-итальянски с овощами и пенне",
                [22] = "Говядина унаги с овощами",
                [23] = "Говядина томленая",
                [24] = "Голубцы ленивые в сметанном соусе",
                [25] = "Голубцы ленивые из мяса птицы",
                [26] = "Гречка отварная с овощами",
                [21] = "Гречка по-купечески",
                [22] = "Гречневая лапша с индейкой",
                [23] = "Гречневая лапша с овощами",
                [24] = "Грудка куриная с картофелем по-деревенски",
                [25] = "Гуляш из говядины с гречкой",
                [26] = "Долма по-восточному с говядиной и курицей",
                [27] = "Драники картофельные с рагу грибным",
                [28] = "Ежики мясные с отварной гречкой",
                [29] = "Запеканка картофельная с мясом",
                [30] = "Жаркое из свинины по-домашнему",
                [31] = "Зразы картофельные с грибами",
                [32] = "Запеканка картофельная с мясом",
                [33] = "Зразы картофельные с фаршем трески с соусом «Тартар»",
                [34] = "Индейка «Тандури» с рисом и брокколи",
                [35] = "Кабачки фаршированные мясом и рисом",
                [36] = "Кальмар «Гриль» с запеченными овощами",
                [37] = "Картоф. пюре, капуста по-баварски, с колбасками",
                [38] = "Картофель беби жареный с вешенками",
                [39] = "Картофель жареный со свининой",
                [40] = "Картофель запеченный с прованскими травами",
                [41] = "Картофель отварной с укропом,",
                [42] = "Картофель по-домашнему",
                [43] = "Картофельное пюре с куриными колбасками",
                [44] = "Каша гречневая с говядиной",
                [45] = "Каша гречневая с грибами и луком",
                [46] = "Кебаб из курицы с соусом",
                [47] = "Кета жареная филе",
                [48] = "Котлета «По-киевски» с сырной начинкой с картофельным пюре",
                [49] = "Котлета из щуки с фасолью и цветной капустой",
                [50] = "Котлета куриная на пару фаршированная брокколи",
                [51] = "Котлета куриная с карт. пюре",
                [52] = "Котлета куриная с овощным соте",
                [53] = "Котлетка из цыпленка с булгуром и овощами",
                [54] = "Котлетки рыбные с запеченными овощами",
                [55] = "Котлеты куриные с моцареллой с булгуром, киноа и овощами",
                [56] = "Креветки в зеленом соусе с лимонным соком",
                [57] = "Крылья куриные в маринаде «Барбекю»",
                [58] = "Куриная грудка «Гриль» с чечевицей и овощным соусом",
                [59] = "Куриная грудка по-французски с рисом",
                [60] = "Куриная грудка с грибами и пенне",
                [61] = "Куриное филе запеченное с кабачками",
                [62] = "Куриное филе под сыром",
                [63] = "Куриное филе с грибами и соусом с томленым картофелем",
                [64] = "Куриное филе с кенийской фасолью",
                [65] = "Куриное филе с диким и бурым рисом с фасолью",
                [66] = "Курица «Терияки» с рисом по-сингапурски",
                [67] = "Куриный кармашек с картофелем и розмарином",
                [68] = "Курица в сливочном соусе с гречкой",
                [69] = "Курица в сливочном соусе с гречкой",
                [70] = "Кускус с овощами и котлетами из индейки",
                [71] = "Кюфта из баранины с томатным соусом с кинзой и рисом",
                [72] = "Лазанья мясная",
                [73] = "Лапша гречневая с куриным филе и овощами в соусе терияки",
                [74] = "Лапша гречневая с цукини и ореховым соусом",
                [75] = "Лапша рисовая с морепродуктами",
                [76] = "Лапша удон «Овощи и курица»",
                [77] = "Лапша удон с морепродуктами",
                [78] = "Лосось филе на коже на гриле",
                [79] = "Люля кебаб из баранины с красным ткемали и печеной картошкой",
                [80] = "Макароны с курицей и грибами",
                [81] = "Макароны с сырным соусом",
                [82] = "Митболы с картофельным пюре",
                [83] = "Митболы с рисом в соусе барбекю пастеризованные",
                [84] = "Мясо по-французски с печеным картофелем",
                [85] = "Оладьи из индейки с картофельным пюре и брокколи",
                [86] = "Оладьи печеночные с картофельным пюре",
                [87] = "Паста «Болоньезе»",
                [88] = "Паста «Арабьата»",
                [89] = "Паста «Карбонара»",
                [90] = "Паста «Орзо» с запеченной курицей",
                [91] = "Паста «Орзо» с лососем в томатно-сливочном соусе",
                [92] = "Паста «Фарфалле» с курицей и соусом песто",
                [93] = "Паста Лингвини с овощами",
                [94] = "Паста Орзо с креветками",
                [95] = "Паста с курицей гриль и сливочно-томатным соусом",
                [96] = "Паста с лососем в сливочном соусе",
                [97] = "Паста с мидиями и кабачками в томатном соусе",
                [98] = "Пельмени отварные с курицей",
                [99] = "Пенне с грибами и овощами",
                [100] = "Перец фаршированный с куриным фаршем",
                [101] = "Печень куриная с овощами и гречкой",
                [102] = "Пироги «По-корейски» с мясом",
                [103] = "Я хачу питсу..",
                [104] = "Плов с говядиной",
                [105] = "Поке с креветкой",
                [106] = "Плов с овощами и нутом",
                [107] = "Плов со свининой",
                [108] = "Рагу из индейки в томатном соусе с пюре",
                [109] = "Рагу овощное с индейкой",
                [110] = "Рамен с курицей в соево-чесночном соусе",
                [111] = "Ребра свиные томленые в соусе барбекю",
                [112] = "Рис азиатский с креветками аргентинскими и овощами",
                [113] = "Рис «По-тайски»",
                [114] = "Рис с куриной бризолью",
                [116] = "Сосиски куриные с картофельным пюре",
                [117] = "Стейк из куриного филе на гриле с брокколи на пару",
                [118] = "Стейк из лосося с картофельным пюре",
                [119] = "Стрипсы из минтая с соусом тар-тар",
                [120] = "Стрипсы куриные",
                [121] = "Тальятелле с курицей в сырном соусе",
                [122] = "Тефтели в сливочно-томатном соусе с рисом",
                [123] = "Тефтели куриные с томатным соусом и гречкой",
                [124] = "Тефтели куриные с картофельным пюре",
                [125] = "Удон с курицей в соусе «Том-ям»",
                [126] = "Фетучини в соусе со свининой и шампиньонами",
                [127] = "Филе индейки «Гриль» с зеленой гречкой",
                [128] = "Филе индейки «Гриль» с пастой птитим со шпинатом и овощами",
                [129] = "Филе минтая жареного в панировке с соусом «Тартар»",
                [130] = "Филе семги на пару с овощным гарниром",
                [131] = "Филе трески с картофельно-тыквенным пюре",
                [132] = "Фрикадельки с грибным соусом и фузилли",
                [133] = "Фрикасе куриное с гречкой",
                [134] = "Фунчоза с курицей и овощами в сладком соусе",
                [135] = "Цветная капуста в панировке",
                [136] = "Цыпленок в кисло-сладком соусе с рисом и овощами",
                [137] = "Цыпленок карри с лапшой удон",
                [138] = "Цыпленок по-мексикански",
                [139] = "Шашлычок куриный с лапшой и фасолью",
                [140] = "Шашлык куриный с картофелем и томатным соусом",
                [141] = "Шашлык свиной (гриль)",
                [142] = "Шницель куриный в яйце с картофельным пюре",
                [143] = "Шницель из свинины в сырной панировке",
                [144] = "Шницель куриный в сырной панировке с макаронами",
                [145] = "Шницель куриный с рисом и овощам",
                [146] = "Жюльен «Грибной» с шампиньонами и белыми грибами",
                [147] = "Сырные палочки с клюквенно-брусничным соусом",
            };
            return JOJI[num];
        }
        public static string Salad(int num)
        {
            Dictionary<int, string> JOJI = new Dictionary<int, string>()
            {
                [0] = "Без салата сегодня",
                [1] = "Мимоза с семгой горячего копчения",
                [2] = "Морковь по-корейски",
                [3] = "«Винегрет»",
                [4] = " «Витаминный» с лимонной заправкой",
                [5] = "«Греческий»",
                [6] = "«Кальмаровый»",
                [7] = "«Крабовый»",
                [8] = "«Норвежский» с лососем",
                [9] = "«Оливье»",
                [10] = "«Сельдь под шубой»,",
                [11] = "«Столичный»",
                [12] = "«Филадельфия»",
                [13] = "«Цезарь»",
                [14] = "Салат из летних овощей",
                [15] = "Салат из запеченной свеклы с сыром фета и киноа",
                [16] = "Салат Кобб с имбирным соусом",
                [17] = "Салат из овощей-гриль",
                [18] = "Салат куриный BBQ",
                [19] = "Салат овощной с креветками и апельсиновым соусом",
                [20] = "Салат рукола с креветками",
                [21] = "Салат охлажденный «Кабачки с морковью по-корейски»",
                [22] = "Салат с баклажаном и сыром «Фета»",
                [23] = "Салат с запеченной тыквой и крем чизом",
                [24] = "Салат с индейкой «Тандури» и соусом «Дзадзики»",
                [25] = "Салат с курицей и ананасами",
                [26] = "Салат с индейкой и соусом «Наршараб»",
                [27] = "Салат с курицей и апельсиновой заправкой",
                [28] = "Салат с курицей и жареными шампиньонами",
                [29] = "Салат с курицей и черносливом",
                [30] = "Салат с курицей и соусом ким-чи",
                [31] = "Салат с лососем, свежими овощами и печеным перцем",
                [32] = "Салат с манго и креветкой",
                [33] = "Салат с мясом индейки и гранатовым соусом",
                [34] = "Салат с рукколой и моцареллой",
                [35] = "Салат с тунцом под горчичным соусом",
                [36] = "Салат с тунцом, фасолью и яблоком",
                [37] = "Салат свекольный с грецким орехом",
                [38] = "Салат фасолевый с шампиньонами и грецким орехом",
                [39] = "Спаржа с морковью по-корейски",
            };
            return JOJI[num];
        }
        public static string RandomSnacks(int num)
        {
            Dictionary<int, string> JOJI = new Dictionary<int, string>()
            {
                // Условно полезное
                [0] = "Никаких перекусов, поешь нормально!",
                [1] = "Абрикос",
                [2] = "Арбуз",
                [3] = "Абрикосы сушеные",
                [4] = "Алыча",
                [5] = "Ананас",
                [6] = "Апельсин",
                [7] = "Арахис жареный в соленой карамели",
                [8] = "Арахис жареный с медом и кунжутом",
                [9] = "Арахис жареный соленый",
                [10] = "Банан",
                [11] = "Виноград",
                [12] = "Вишня",
                [13] = "Голубика",
                [14] = "Горошек свежий",
                [15] = "Гранадилла",
                [16] = "Гранат",
                [17] = "Грейпфрут",
                [18] = "Груша ",
                [19] = "Дыня",
                [20] = "Ежевика",
                [21] = "Желе фруктово - ягодное",
                [22] = "Инжир",
                [23] = "Кешью",
                [24] = "Клубника",
                [25] = "Кукуруза отварная",
                [26] = "Личи",
                [27] = "Малина",
                [28] = "Манго",
                [29] = "Манго сушеное",
                [30] = "Мандарины",
                [31] = "Маракуйя",
                [32] = "Микс из микрозелени подсолнечника и салата кейла",
                [33] = "Микс ореховый с мармеладом",
                [34] = "Миндаль",
                [35] = "Микс сублимированный Клубника-Персик",
                [36] = "Миндаль в медовой глазури с карри и перцем чили",
                [37] = "Нектарин",
                [38] = "Огурцы",
                [39] = "Орех грецкий",
                [40] = "Орех макадамия",
                [41] = "Орехи кедровые",
                [42] = "Орехи фисташковые",
                [43] = "Персик",
                [44] = "Питахайя",
                [45] = "Помело",
                [46] = "Семечки белые",
                [47] = "Семечки жареные соленые",
                [48] = "Семечки тыквенные обжаренные",
                [49] = "Слива",
                [50] = "Смесь из орехов и изюма",
                [51] = "Помидорчик",
                [52] = "Цукаты из апельсина/лимона",
                [53] = "Черешня",
                [54] = "Черника",
                [55] = "Яблоко",
                [56] = "Яблоко сушеное",
                // Условно вредное
                [57] = "Кукурузные палочки",
                [58] = "Попкорн сладкий/соленый/карамельный",
                [59] = "Флайчипсы зерновые",
                [60] = "Чипсы картофельные",
                [61] = "Начос",
                // Сладкое
                [62] = "Пряники",
                [63] = "Шоколад молочный/горький/белый",
                [64] = "Арахисовая паста",
                [65] = "Дайфукумоти",
                [66] = "Макарон",
                [67] = "Эклерчик шоколадный/ванильный/сливочный",
                [68] = "Банановый кекс с орехом",
                [69] = "Безе",
                [70] = "Брауни",
                [71] = "Вафельные трубочки (без начинки)",
                [72] = "Вафельные трубочки с вареной сгущенкой",
                [73] = "Вафли",
                [74] = "Вафли «Голландские»",
                [75] = "Галета с вишней",
                [76] = "Веррин",
                [77] = "Наполеон",
                [78] = "Ромовая баба",
                [79] = "Тирамису",
                [80] = "Суфле с шоколадом",
                [81] = "Трайфл с вишней",
                [82] = "Щербет",
                [83] = "Пончик",
                [84] = "Медовик",
                [85] = "Панакота манго-маракуйя",
                [86] = "Парфе",
                [87] = "Драже «Арахис в молочном шоколаде»",
                [88] = "Драже «Изюм в шоколаде»",
                [89] = "Желе фруктово-ягодное",
                [90] = "Зефир белый",
                [91] = "Зефир в шоколаде",
                [92] = "Зефир воздушный",
                [93] = "Ирис с какао",
                [94] = "Имбирь в сахаре",
                [95] = "Карамель на палочке",
                [96] = "Кексик",
                [97] = "Козинак",
                [98] = "Клюква в сахарной пудре",
                [99] = "Колбаса шоколадная с фисташкой и кешью",
                [101] = "Колечки заварные «Воздушные»",
                [102] = "Крекер «Крендель соленый",
                [103] = "Крекер «Рыбки»",
                [104] = "Кукис шоколадный",
                [105] = "Кукис с карамелью и арахисовой пастой",
                [106] = "Курабье Бакинское",
                [107] = "Лукум",
                [108] = "Мармелад",
                [109] = "Меренга",
                [110] = "Мини плюшки с корицей и сахаром",
                [111] = "Мороженое",
                [112] = "Пай «Яблочно-сметанный»",
                [113] = "Пай «Вишневый»",
                [114] = "Панна-котта",
                [115] = "Пастила",
                [116] = "Пахлава",
                [117] = "Песочная полоска с повидлом",
                [118] = "Печенье «Марципановое с лимоном»",
                [119] = "Печенье «Медовое»",
                [120] = "Печенье «Мутаки»",
                [121] = "Печенье «Рикоттини»",
                [122] = "Печенье «Орешки» с варёной сгущёнкой,",
                [123] = "Печенье злаковое",
                [124] = "Печенье овсяное",
                [125] = "Печенье песочное",
                [126] = "Печенье с пармезаном",
                [127] = "Пирог «Сметанник»",
                [128] = "Пирог яблочный,",
                [129] = "Пирожное «Дакуаз»",
                [130] = "Пирожное «Картошка»",
                [131] = "Пирожное «Монтблан»",
                [132] = "Пирожное «Париж-Брест»",
                [133] = "Пирожное «Профитроли»",
                [134] = "Пирожное муссовое",
                [135] = "Пишмание",
                [136] = "Пудинг",
                [137] = "Рулет",
                [138] = "Сочники с творогом",
                [139] = "Соломка сладкая",
                [140] = "Трубочки с белковым кремом",
                [141] = "Чак-Чак",
                [142] = "Чизкейк",
                [143] = "Штрудель «Яблочный»",
                [144] = "Штрудель вишневый",
                [145] = "Яйцо шоколадное с сюрпризом",

            };
            return JOJI[num];
        }
        public static string Drink(int num)
        {
            Dictionary<int, string> JOJI = new Dictionary<int, string>()
            {
                [0] = "Стакан вобдически",
                [1] = "Морс клюквенный",
                [2] = "Кофе",
                [3] = "Арбузный фреш",
                [4] = "Кисель вишневый/облепиховый/малиновый",
                [5] = "Глинтвейн",
                [6] = "Горячий шоколад",
                [7] = "Какава",
                [8] = "Смузи с любимыми фруктами",
                [9] = "Квас",
                [10] = "Клюквенный пунш",
                [11] = "Чай зеленый",
                [12] = "Чай черный",
                [13] = "Чай улун",
                [14] = "Чай каркаде",
                [15] = "Камбуча",
                [16] = "Кумыс",
                [17] = "Компот яблочный/вишневый/абрикосовый",
                [18] = "Лимонад",
                [19] = "Сок апельсиновый/ананасовый",
                [20] = "Сок яблочный/грушевый",
                [21] = "Молоко миндальное",
                [22] = "Шорли",
                [23] = "Нектар морковный/томатный",
                [24] = "Нектар мальновый/клубничный",
                [25] = "Сок березовый :|",
                [26] = "Биойогурт питьевой",
                [27] = "Компот из айвы/из фейхоа",
                [28] = "Нектар черешневый/банановый",
                [29] = "Сок гранатовый/виноградный",
                [30] = "Сок мультифруктовый/ грейпфрукт",
                [31] = "Кисель клюквичный/ягодно-овсяный",
            };
            return JOJI[num];
        }

        //Buttons
        private void RefreshButtonBreakfast(object sender, EventArgs e)
        {
            Breakfastest();
        }
        private void RefrechButtonLunch(object sender, EventArgs e)
        {
            Lunch();
        }
        private void RefreshButtonDinner(object sender, EventArgs e)
        {
            Dinner();
        }
        private void RefreshButtonSnacks(object sender, EventArgs e)
        {
            Snacks();
        }
    }
}